2/code/data/run_110/system/singleGraph
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      sample;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

type sets;
libs            ("libsampling.so");

interpolationScheme cell;

setFormat       raw;

writeControl    writeTime; // this ensures that it's writing only at writeInterval

sets
(

    // make sure to change (x1 y1 z1) and (x2 y2 z2) to
    // the coordinates of the start and end points

    recirculation
    {
        type    lineCell;
        axis    xyz;
        // recirculation 
        	start   (0.5 0 0);
                end     (10.0 0 0);
                    
    }
    cylwall
    {
        type    points;
        axis    xyz;
        // cylwall 
	points   ((0.5 0.0 0) (0.383022221559489 0.3213938048432696 0) (0.08682408883346521 0.492403876506104 0) (-0.2499999999999999 0.43301270189221935 0) (-0.46984631039295416 0.17101007166283444 0) (-0.4698463103929542 -0.17101007166283433 0) (-0.2500000000000002 -0.4330127018922192 0) (0.08682408883346499 -0.49240387650610407 0) (0.3830222215594889 -0.3213938048432698 0) (0.5 -1.2246467991473532e-16 0));
                    
    }
    cylnormal_pi4
    {
        type    lineCell;
        axis    xyz;
        // cylnormal_pi4 
	start   (0.3535533905932738 0.35355339059327373 0);
	end     (2.4748737341529163 2.474873734152916 0);
                    
    }
    cylnormal_pi2
    {
        type    lineCell;
        axis    xyz;
        // cylnormal_pi2 
	start   (3.061616997868383e-17 0.5 0);
	end     (2.143131898507868e-16 3.5 0);
                    
    }
    cylnormal_3pi4
    {
        type    lineCell;
        axis    xyz;
        // cylnormal_3pi4 
	start   (-0.35355339059327373 0.3535533905932738 0);
	end     (-2.474873734152916 2.4748737341529163 0);
                    
    }

);

fields          ( p U );


// ************************************************************************* //
